Функция CreatePOST(Запрос)
	Возврат Ответ(Запрос, "Демо_КонтроллерСервиса.СоздатьЗаявку");
КонецФункции

Функция projectsCreatePOST(Запрос)
	Возврат Ответ(Запрос, "Демо_КонтроллерСервиса.СоздатьПроект");
КонецФункции

Функция requestsGET(Запрос)
	Возврат Ответ(Запрос, "Демо_КонтроллерСервиса.ПолучитьЗаявки");
КонецФункции

Функция projectsGET(Запрос)
	Возврат Ответ(Запрос, "Демо_КонтроллерСервиса.ПолучитьПроекты");
КонецФункции

Функция projects_signleGET(Запрос)
	Возврат Ответ(Запрос, "Демо_КонтроллерСервиса.ПолучитьПроект");
КонецФункции

Функция projects_signle_file_POST(Запрос)
	Возврат Ответ(Запрос, "Демо_КонтроллерСервиса.ПоместитьФайлыПроекта")
КонецФункции

Функция Ответ(Запрос, ИмяОбработчика)
	Возврат ОбработкаHTTPЗапросов.ОбработатьЗапрос(
		Запрос,
		ИмяОбработчика,
		Метаданные.HTTPСервисы.Демо_
	);
КонецФункции

