// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область АПИ

// В формат.
// 
// Параметры:
//  Ссылка - СправочникСсылка
//  Данные - см. НовыеДанные
//  Кеш - Структура - Кеш
// 
// Возвращаемое значение:
//  см. СхемаОтветаАПИ
Функция ВФормат(Ссылка, Данные = Неопределено, Кеш = Неопределено) Экспорт
	
	ЛокальныйКеш = Кеширование.ЛокальныйКеш(Кеш, "Формат_Демо_Проект");
	Если ЛокальныйКеш <> Неопределено И Кеширование.ЗначениеИзКеша(Ссылка, ЛокальныйКеш) <> Неопределено Тогда
		Возврат Кеширование.ЗначениеИзКеша(Ссылка, ЛокальныйКеш);	
	КонецЕсли;
	
	//	Здесь уже можно заполнять при наличии БСП удобнее
	//  Реквизиты = ОбщегоНазначения.ЗначенияРеквизитов() 
	Если Данные = Неопределено Тогда
		Реквизиты = НовыеДанные();
		ЗаполнитьЗначенияСвойств(Реквизиты, Ссылка);
	Иначе
		Реквизиты = Данные;
	КонецЕсли;
	
	Результат = СхемаОтветаАПИ();
	Результат.id = XMLСтрока(Ссылка);
	Результат.name = Реквизиты.Наименование;
	Результат.project_owner = Реквизиты.Ответственный;
	
	Кеширование.ПоместитьЗначениеВКеш(Новый ФиксированнаяСтруктура(Результат), Ссылка, ЛокальныйКеш);
	
	Возврат Результат;
КонецФункции

// Схема ответа АПИ.
// 
// Возвращаемое значение:
//  Структура - Схема ответа АПИ:
// * name - Строка -
// * project_owner - Строка -
// * id - Строка -
Функция СхемаОтветаАПИ() Экспорт
	
	Схема = Новый Структура();
	Схема.Вставить("name", "");
	Схема.Вставить("project_owner", "");
	Схема.Вставить("id", "");
	
	Возврат Схема;
	
КонецФункции

// Новые данные.
// 
// Возвращаемое значение:
//  Структура - Новые данные:
// * Наименование - Строка
// * Ответственный - Строка
Функция НовыеДанные() Экспорт
	НовыеДанные = Новый Структура();
	НовыеДанные.Вставить("Наименование");
	НовыеДанные.Вставить("Ответственный");
	
	Возврат НовыеДанные;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
