// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область АПИ

// см. ВосстановлениеXDTO.НовыеПараметрыВосстановления
Функция ФункцииВосстановления() Экспорт
	
	ПараметрыВосстановления = ВосстановлениеXDTO.НовыеПараметрыВосстановления();
	Строка = ПараметрыВосстановления.Добавить();
	Строка.СвойствоИсходное = "reply_message";
	Строка.ИмяСвойства = "СообщениеОтвета";
	Строка.ФункцияВосстановленияЗначения = "Демо_ФункцииВосстановления.ВосстановитьСообщение";
	
	Строка = ПараметрыВосстановления.Добавить();
	Строка.СвойствоИсходное = "body";
	Строка.ИмяСвойства = "ТелоСообщения";
	
	Возврат ПараметрыВосстановления;

КонецФункции


#КонецОбласти

#КонецОбласти

#КонецЕсли