
#Область ПрограммныйИнтерфейс

// Для целей мемоизации можно использовать и модули с повторным использованием значений
// Конкретно в этом примере хотелось показать, что ДопПараметры прокидываются во все функции восстановления,
// соответственно результат одной функции можно использовать в другой, но в общем случае порядок выполнения не гарантирован
Функция ВосстановитьПроект(Значение, ДопПараметры) Экспорт
	
	ЛокальныйКеш = Кеширование.ЛокальныйКеш(ДопПараметры, "Кеш_ПроектыПоУУИД");
	
	ЗначениеИзКеша = Кеширование.ЗначениеИзКеша(Значение, ЛокальныйКеш);
	
	Если ЗначениеИзКеша <> Неопределено Тогда
		Возврат ЗначениеИзКеша;
	КонецЕсли;
	
	Ссылка = XMLЗначение(Тип("СправочникСсылка.Демо_Проекты"), Значение);
	Если Не ОбщегоНазначенияХТТП.СсылкаСуществует(Ссылка) Тогда
		СервисыОбщее.ВызватьИсключениеПроверки(
			СтрШаблон("Project with id = %1 does not exist", Значение)
		);
	КонецЕсли;
	
	Кеширование.ПоместитьЗначениеВКеш(Ссылка, Значение, ЛокальныйКеш);
	
	Возврат Ссылка;
	
	
КонецФункции

Функция ВосстановитьСообщение(Значение, ДопПараметры) Экспорт
	
	ЛокальныйКеш = Кеширование.ЛокальныйКеш(ДопПараметры, "Кеш_СообщенияПоУУИД");
	
	ЗначениеИзКеша = Кеширование.ЗначениеИзКеша(Значение, ЛокальныйКеш);
	
	Если ЗначениеИзКеша <> Неопределено Тогда
		Возврат ЗначениеИзКеша;
	КонецЕсли;
	
	Ссылка = XMLЗначение(Тип("ДокументСсылка.Демо_Сообщение"), Значение);
	Если Не ОбщегоНазначенияХТТП.СсылкаСуществует(Ссылка) Тогда
		СервисыОбщее.ВызватьИсключениеПроверки(
			СтрШаблон("message with id = %1 does not exist", Значение)
		);
	КонецЕсли;
	
	Кеширование.ПоместитьЗначениеВКеш(Ссылка, Значение, ЛокальныйКеш);
	
	Возврат Ссылка;
	
КонецФункции

#КонецОбласти
